<!DOCTYPE html>



  


<html class="theme-next pisces use-motion" lang="zh-Hans">
<head>
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>









<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />















  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="C++," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.1" />






<meta name="description" content="先交代最基本的原则。">
<meta name="keywords" content="C++">
<meta property="og:type" content="article">
<meta property="og:title" content="C++ 对象模型">
<meta property="og:url" content="http://lyyua.com/2018/04/12/cpp_memory/index.html">
<meta property="og:site_name" content="Back">
<meta property="og:description" content="先交代最基本的原则。">

<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div></pre></td><td class="code"><pre><div class="line">struct InefficientPacking&#123;</div><div class="line">	U32 mU1; //32 （4字节对齐）                         </div><div class="line">	F32 mF2; //32 （4字节对齐）</div><div class="line">	char* mP6; //32	（4字节对齐）</div><div class="line">	I32 mI4; //32（4字节对齐）</div><div class="line">	bool mB5; //8 （1字节对齐）</div><div class="line">	U8 mB3; //8  （1字节对齐）</div><div class="line">	U8 _pad[2] ; // 明确的填充</div><div class="line">&#125;</div></pre></td></tr></table></figure>
<p>还有一点，关于大小，抛开虚函数和虚继承，C++类实例的大小完全取决于一个类及其基类的成员变量！成员函数基本上不影响类实例的大小。<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div></pre></td><td class="code"><pre><div class="line">struct  B &#123;  </div><div class="line">public :  </div><div class="line">   int  bm1;  </div><div class="line">protected :  </div><div class="line">   int  bm2;  </div><div class="line">private :  </div><div class="line">   int  bm3;  </div><div class="line">   static   int  bsm; //存在静态区  </div><div class="line">   void  bf();  </div><div class="line">   static   void  bsf();  </div><div class="line">   typedef   void * bpv;  </div><div class="line">   struct  N &#123; &#125;;  </div><div class="line">&#125;;</div></pre></td></tr></table></figure></p>
<p><img src="/2018/04/12/cpp_memory/cppstruct.jpg" alt=""></p>
<h1 id="在单继承上的分布"><a href="#在单继承上的分布" class="headerlink" title="在单继承上的分布"></a>在单继承上的分布</h1><p>基类<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div></pre></td><td class="code"><pre><div class="line">struct  C &#123;  </div><div class="line">   int  c1;  </div><div class="line">   void  cf();  </div><div class="line">&#125;;</div></pre></td></tr></table></figure></p>
<p>派生类<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div></pre></td><td class="code"><pre><div class="line">struct  D : C &#123;  </div><div class="line">   int  d1;  </div><div class="line">   void  df();  </div><div class="line">&#125;;</div></pre></td></tr></table></figure></p>
<p><img src="/2018/04/12/cpp_memory/singleinherit.jpg" alt=""></p>
<p>或者这么看<br>在VS类-&gt;属性-&gt;C/C++ –&gt; 命令行–&gt; 其他选项</p>
<blockquote>
<ul>
<li>/d1 reportAllClassLayout 查看所有类</li>
<li>/d1 reportSingleClassLayoutXXX（XXX为类名）</li>
</ul>
</blockquote>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div></pre></td><td class="code"><pre><div class="line">class D	size(8):</div><div class="line">	+---</div><div class="line"> 0	| +--- (base class C)</div><div class="line"> 0	| | c1</div><div class="line">	| +---</div><div class="line"> 4	| d1</div><div class="line">	+---</div></pre></td></tr></table></figure>
<p>派生类要保留基类的所有属性和行为，自然地，每个派生类的实例都包含了一份完整的基类实例数据。<br>几乎所有C++厂商默认在单继承类层次下，每一个新的派生类都简单地把自己的成员变量添加到基类的成员变量之后，这样只要有了派生类D的指针，不需要去计算偏移量了。</p>
<p>比如：<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div></pre></td><td class="code"><pre><div class="line">D* pd;  </div><div class="line">pd-&gt;c1; // *(pd + dDC + dCc1); // *(pd + dCc1);   </div><div class="line">pd-&gt;d1; // *(pd + dDd1);</div></pre></td></tr></table></figure></p>
<blockquote>
<ul>
<li>当访问基类成员c1时，计算步骤本来应该为“pd+dDC+dCc1”，即为先计算D对象和C对象之间的偏移，C对象指针与成员变量c1之间的偏移量。由于dDC恒定为0，所以直接表达为pd+dCc1。</li>
<li>当访问派生类成员d1时，直接计算偏移量。</li>
</ul>
</blockquote>
<h1 id="多重继承上的分布"><a href="#多重继承上的分布" class="headerlink" title="多重继承上的分布"></a>多重继承上的分布</h1><p>定义一个结构E<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div></pre></td><td class="code"><pre><div class="line">struct E</div><div class="line">&#123;</div><div class="line">	int e1 = 5;</div><div class="line">	void ee();</div><div class="line">&#125;;</div></pre></td></tr></table></figure></p>
<p>再定义一个结构F，让他继承C、E<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div></pre></td><td class="code"><pre><div class="line">struct F :C, E</div><div class="line">&#123;</div><div class="line">	int f1 = 6;</div><div class="line">	void ff();</div><div class="line">&#125;;</div></pre></td></tr></table></figure></p>
<p><img src="/2018/04/12/cpp_memory/multieinherit.jpg" alt=""></p>
<p>此时看一下内存布局<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div></pre></td><td class="code"><pre><div class="line">class F	size(12):</div><div class="line">	+---</div><div class="line"> 0	| +--- (base class C)</div><div class="line"> 0	| | c1</div><div class="line">	| +---</div><div class="line"> 4	| +--- (base class E)</div><div class="line"> 4	| | e1</div><div class="line">	| +---</div><div class="line"> 8	| f1</div><div class="line">	+---</div></pre></td></tr></table></figure></p>
<p>多继承的成员变量地址计算：<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div></pre></td><td class="code"><pre><div class="line">F* pf;  </div><div class="line">pf-&gt;c1; // *(pf + dFC + dCc1); // *(pf + dFc1);   </div><div class="line">pf-&gt;e1; // *(pf + dFE + dEe1); // *(pf + dFe1);   </div><div class="line">pf-&gt;f1; // *(pf + dFf1);</div></pre></td></tr></table></figure></p>
<p>与单继承相同的是，F实例拷贝了每个基类的所有数据。 与单继承不同的是，在多重继承下，内嵌的两个基类C,E，他们的对象指针不可能全都与派生类对象指针相同：</p>
<p>输出一看：<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div></pre></td><td class="code"><pre><div class="line">int main()</div><div class="line">&#123;</div><div class="line">	F f;</div><div class="line">	std::stringstream ss;</div><div class="line">	ss &lt;&lt; &quot;F实例地址：&quot; &lt;&lt; &amp;f &lt;&lt; &quot;\n&quot;    //0073FBB4</div><div class="line">		&lt;&lt; &quot;转到基类C：&quot; &lt;&lt; (void*)(C*)&amp;f &lt;&lt; &quot;\n&quot;  //0073FBB4</div><div class="line">		&lt;&lt; &quot;转到基类E：&quot; &lt;&lt; (void*)(E*)&amp;f; //0073FBB8</div><div class="line">	std::cout &lt;&lt; ss.str() &lt;&lt; std::endl;</div><div class="line">	system(&quot;pause&quot;);</div><div class="line">	return 0;</div><div class="line">&#125;</div></pre></td></tr></table></figure></p>
<p>具体的编译器实现可以自由地选择内嵌基类和派生类的布局。 VC++ 按照基类的声明顺序 先排列基类实例数据，最后才排列派生类数据。 当然，派生类数据本身也是按照声明顺序布局的（本规则并非一成不变 ，我们会看到，当一些基类有虚函数而另一些基类没有时，内存布局并非如此）。</p>
<h1 id="虚继承上的分布"><a href="#虚继承上的分布" class="headerlink" title="虚继承上的分布"></a>虚继承上的分布</h1><h2 id="虚继承的作用："><a href="#虚继承的作用：" class="headerlink" title="虚继承的作用："></a>虚继承的作用：</h2><p>如果经理类和工人类都继承自“雇员类”，将会发生什么？</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div></pre></td><td class="code"><pre><div class="line">struct  Employee &#123; ... &#125;;  </div><div class="line">struct  Manager : Employee &#123; ... &#125;;  </div><div class="line">struct  Worker : Employee &#123; ... &#125;;  </div><div class="line">struct  MiddleManager : Manager, Worker &#123; ... &#125;;</div></pre></td></tr></table></figure>
<p>如果经理类和工人类都继承自雇员类，很自然地，它们每个类都会从雇员类获得一份数据拷贝。</p>
<blockquote>
<ul>
<li>成员变量名的二义性，Manager继承至Employee，有工资属性，Worker继承至Employee，也有工资属性，那么MiddleManager实例的工资属性指向的是哪个？</li>
<li>两个实例，如果不作特殊处理，一线经理类的实例将含有<strong>两个雇员类实例</strong>，它们分别来自两个雇员基类 。</li>
<li>空间浪费，如果雇员类成员变量不多，问题不严重；如果成员变量众多，则那份多余的拷贝将造成实例生成时的严重开销。</li>
<li>数据不安全，这两份不同的雇员实例可能分别被修改，比如一线经理类强转成Worker类，此时修改的工资属性，造成数据的不一致。</li>
</ul>
</blockquote>
<p>可以打开VS写个示例看看：<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div></pre></td><td class="code"><pre><div class="line">struct C&#123; int c1 =0;&#125;</div><div class="line">struct D : C&#123;...&#125;</div><div class="line">struct DD : C&#123;...&#125;</div><div class="line">struct FF : D,DD&#123;...&#125;</div><div class="line">int main()&#123;</div><div class="line">	FF ff;</div><div class="line">	DD* dd = (DD*)&amp;ff;</div><div class="line">	dd-&gt;c1 = 999;</div><div class="line">&#125;</div></pre></td></tr></table></figure></p>
<p>输出：<br><img src="/2018/04/12/cpp_memory/multieinherit.png" alt=""></p>
<p>依然是上面的实例，稍微改一改<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div></pre></td><td class="code"><pre><div class="line">struct C&#123; int c1 =0;&#125;</div><div class="line">struct D : virtual C&#123;...&#125;</div><div class="line">struct DD : virtual C&#123;...&#125;</div><div class="line">struct FF : D,DD&#123;...&#125;</div><div class="line">int main()&#123;</div><div class="line">	FF ff;</div><div class="line">	DD* dd = (DD*)&amp;ff;</div><div class="line">	dd-&gt;c1 = 999;</div><div class="line">&#125;</div></pre></td></tr></table></figure></p>
<p><img src="/2018/04/12/cpp_memory/multieinherit1.png" alt=""></p>
<p>这样，操作的其实就是同一份内存了。</p>
<h2 id="虚继承的内存分布："><a href="#虚继承的内存分布：" class="headerlink" title="虚继承的内存分布："></a>虚继承的内存分布：</h2><p>在单继承和多重继承的情况下，内嵌的基类实例地址比起派生类实例地址来，要么地址相同（单继承，以及多重继承的最靠左基类） ，要么地址相差一个固定偏移量（多重继承的非最靠左基类） 。 </p>
<p>然而，当虚继承时，一般说来，派生类地址和其虚基类地址之间的偏移量是不固定的，因为如果这个派生类又被进一步继承的话，最终派生类会把共享的虚基类实例数据放到一个与上一层派生类不同的偏移量处。</p>
<p>定义G虚继承于C<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div></pre></td><td class="code"><pre><div class="line">struct G :virtual C</div><div class="line">&#123;</div><div class="line">	int g1 =9;</div><div class="line">	void gg();</div><div class="line">&#125;;</div></pre></td></tr></table></figure></p>
<p><img src="/2018/04/12/cpp_memory/virtualinherit.jpg" alt=""></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div></pre></td><td class="code"><pre><div class="line">class G	size(12):</div><div class="line">	+---</div><div class="line"> 0	| &#123;vbptr&#125;</div><div class="line"> 4	| g1</div><div class="line">	+---</div><div class="line">	+--- (virtual base C)</div><div class="line"> 8	| c1</div><div class="line">	+---</div><div class="line">G::$vbtable@:</div><div class="line"> 0	| 0</div><div class="line"> 1	| 8 (Gd(G+0)C)</div></pre></td></tr></table></figure>
<p>GdGvbptrG 是指在G对象中，G对象指针与G虚基类表的指针偏移量，自然为0；<br>GdGvbptrC 是指在G对象中，G对象指针与C虚基类表的指针偏移量，为8</p>
<p>同理，如果让H虚继承于C，也会得到类似的结果。<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div></pre></td><td class="code"><pre><div class="line">struct H : virtual C&#123;</div><div class="line">	int h1 = 10;</div><div class="line">	void hh();</div><div class="line">&#125;</div></pre></td></tr></table></figure></p>
<p><img src="/2018/04/12/cpp_memory/h_virtualinherit.jpg" alt=""><br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div></pre></td><td class="code"><pre><div class="line">class H	size(12):</div><div class="line">	+---</div><div class="line"> 0	| &#123;vbptr&#125;</div><div class="line"> 4	| h1</div><div class="line">	+---</div><div class="line">	+--- (virtual base C)</div><div class="line"> 8	| c1</div><div class="line">	+---</div><div class="line">H::$vbtable@:</div><div class="line"> 0	| 0</div><div class="line"> 1	| 8 (Hd(H+0)C)</div></pre></td></tr></table></figure></p>
<p>此时再定义一个I<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div></pre></td><td class="code"><pre><div class="line">struct  I : G, H &#123;  </div><div class="line">   int  i1;  </div><div class="line">   void  _if();  </div><div class="line">&#125;;</div></pre></td></tr></table></figure></p>
<p><img src="/2018/04/12/cpp_memory/i_virtualinherit.jpg" alt=""></p>
<p>或者直接看你下面的内存布局</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div><div class="line">18</div><div class="line">19</div><div class="line">20</div><div class="line">21</div><div class="line">22</div><div class="line">23</div></pre></td><td class="code"><pre><div class="line">class I	size(24):</div><div class="line">	+---</div><div class="line"> 0	| +--- (base class G)</div><div class="line"> 0	| | &#123;vbptr&#125;</div><div class="line"> 4	| | g1</div><div class="line">	| +---</div><div class="line"> 8	| +--- (base class H)</div><div class="line"> 8	| | &#123;vbptr&#125;</div><div class="line">12	| | h1</div><div class="line">	| +---</div><div class="line">16	| i1</div><div class="line">	+---</div><div class="line">	+--- (virtual base C)</div><div class="line">20	| c1</div><div class="line">	+---</div><div class="line"></div><div class="line">I::$vbtable@G@:</div><div class="line"> 0	| 0  </div><div class="line"> 1	| 20 (Id(G+0)C)    //G ~ I 为0  G ~ C 为20</div><div class="line"></div><div class="line">I::$vbtable@H@:</div><div class="line"> 0	| 0</div><div class="line"> 1	| 12 (Id(H+0)C)   //H ~ H 为0  H ~ C 为12</div></pre></td></tr></table></figure>
